## Module 1: Data Preprocessing

#### Pre-processing the dataset:
In this task you will be working on handling null values, deletion or transformation of irrelevant values, data type transformation, removing duplicates and data validations. Once you have completed this task, you will get a refined and a cleaner data set for further analysis.


Steps to perform Data Pre-processing: 

Step 1: Removing duplicate rows 

Step 2: Removing rows for which numeric columns are having irrelevant data type values

Step 3: Remove irrelevant values from each column if any. Validation of all values for a column
        Check for any inconsistencies or discrepancies in data types, units, or formats.
        Feel free to add more validation checks which you might feel necessary for the datasetâ€™s integrity
        
Step 4: Export the cleaned dataset as a .csv file: prefer UTF-8 encoding.

Step 5: Convert the pre-processed dataset into an SQL file. 

Step 6: Manually generate a table by utilizing the database information provided in the "Database Info" tab.

In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv("Uncleaned_employees_final_dataset.CSV")

In [4]:
df.head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met_more_than_80,awards_won,avg_training_score
0,8724,Technology,region_26,Bachelors,m,sourcing,1,24,NaN,1,1,0,77
1,74430,HR,region_4,Bachelors,f,other,1,31,3.0,5,0,0,51
2,72255,Sales & Marketing,region_13,Bachelors,m,other,1,31,1.0,4,0,0,47
3,38562,Procurement,region_2,Bachelors,f,other,3,31,2.0,9,0,0,65
4,64486,Finance,region_29,Bachelors,m,sourcing,1,30,4.0,7,0,0,61

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17417 entries, 0 to 17416
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   employee_id            17417 non-null  int64
 1   department             17417 non-null  object
 2   region                 17417 non-null  object
 3   education              16646 non-null  object
 4   gender                 17417 non-null  object
 5   recruitment_channel    17417 non-null  object
 6   no_of_trainings        17417 non-null  int64
 7   age                    17417 non-null  int64
 8   previous_year_rating   16054 non-null  float64
 9   length_of_service      17417 non-null  int64
 10  KPIs_met_more_than_80  17417 non-null  int64
 11  awards_won             17417 non-null  int64
 12  avg_training_score     17417 non-null  int64
dtypes: float64(1), int64(7), object(5)
memory usage: 1.7+ MB

In [11]:
df.duplicated().sum()

2

In [13]:
df.drop_duplicates(inplace=True)

In [14]:
df.head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met_more_than_80,awards_won,avg_training_score
0,8724,Technology,region_26,Bachelors,m,sourcing,1,24,NaN,1,1,0,77
1,74430,HR,region_4,Bachelors,f,other,1,31,3.0,5,0,0,51
2,72255,Sales & Marketing,region_13,Bachelors,m,other,1,31,1.0,4,0,0,47
3,38562,Procurement,region_2,Bachelors,f,other,3,31,2.0,9,0,0,65
4,64486,Finance,region_29,Bachelors,m,sourcing,1,30,4.0,7,0,0,61

In [16]:
df.shape

(17415, 13)

In [17]:
df = df.dropna(axis=0, subset=['previous_year_rating'])

In [18]:
df.shape

(16052, 13)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17417 entries, 0 to 17416
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   employee_id            17417 non-null  int64
 1   department             17417 non-null  object
 2   region                 17417 non-null  object
 3   education              16646 non-null  object
 4   gender                 17417 non-null  object
 5   recruitment_channel    17417 non-null  object
 6   no_of_trainings        17417 non-null  int64
 7   age                    17417 non-null  int64
 8   previous_year_rating   16054 non-null  float64
 9   length_of_service      17417 non-null  int64
 10  KPIs_met_more_than_80  17417 non-null  int64
 11  awards_won             17417 non-null  int64
 12  avg_training_score     17417 non-null  int64
dtypes: float64(1), int64(7), object(5)
memory usage: 1.7+ MB

In [18]:
df.head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met_more_than_80,awards_won,avg_training_score
0,8724,Technology,region_26,Bachelors,m,sourcing,1,24,NaN,1,1,0,77
1,74430,HR,region_4,Bachelors,f,other,1,31,3.0,5,0,0,51
2,72255,Sales & Marketing,region_13,Bachelors,m,other,1,31,1.0,4,0,0,47
3,38562,Procurement,region_2,Bachelors,f,other,3,31,2.0,9,0,0,65
4,64486,Finance,region_29,Bachelors,m,sourcing,1,30,4.0,7,0,0,61

In [22]:
df.to_csv('cleaned_employees_final_dataset.csv', encoding='utf-8', index=False)

## Module 2: Data Analysis in SQL

### 1) Find the average age of employees in each department and gender group. ( Round average  age up to two decimal places if needed)

In [ ]:
select `department`,`gender`, round(avg(`age`),2) from employee
group by `department`,`gender`;

### 2) List the top 3 departments with the highest average training scores. ( Round average scores up to two decimal places if needed)

In [ ]:
select `department`, round(avg(`avg_training_score`),2) from employee
group by `department`
order by round(avg(`avg_training_score`),2) desc
limit 3;

### 3) Find the percentage of employees who have won awards in each region. (Round percentages up to two decimal places if needed)

In [ ]:
select `region`,
round(count(*)*100/(select sum(awards_won) from employee),2) as "award_percentage"
from employee
where awards_won!=0
group by `region`;

### 4) Show the number of employees who have met more than 80% of KPIs for each recruitment channel and education level.

In [ ]:
select `recruitment_channel`,`education`,
sum(`KPIs_met_more_than_80`)
from employee
group by `recruitment_channel`,`education`;

### 5) Find the average length of service for employees in each department, considering only employees with previous year ratings greater than or equal to 4. ( Round average length up to two decimal places if needed)

In [ ]:
select `department`,round(avg(`length_of_service`),2)
from employee
where `previous_year_rating` >= 4
group by `department`;

### 6) List the top 5 regions with the highest average previous year ratings. ( Round average ratings up to two decimal places if needed)

In [ ]:
select `region`,round(avg(`previous_year_rating`),2)
from employee
group by `region`
order by avg(`previous_year_rating`) desc
limit 5;

### 7) List the departments with more than 100 employees having a length of service greater than 5 years.

In [ ]:
select `department`,count(*)
from employee
where `length_of_service`>5
group by `department`
having count(*)>100;

### 8) Show the average length of service for employees who have attended more than 3 trainings, grouped by department and gender. ( Round average length up to two decimal places if needed)

In [ ]:
select `department`,`gender`, round(avg(`length_of_service`),2)
from employee
where `no_of_trainings`>3
group by `department`, `gender`;

### 9) Find the percentage of female employees who have won awards, per department. Also show the number of female employees who won awards and total female employees. ( Round percentage up to two decimal places if needed)

In [ ]:
select `department`,
sum(`awards_won`),
count(*),
round(sum(`awards_won`)/count(*)*100,2)
from employee
where `gender`='f'
group by `department`;

### 10) Calculate the percentage of employees per department who have a length of service between 5 and 10 years. ( Round percentage up to two decimal places if needed)

In [ ]:
select `department`,
round((count(case when `length_of_service`>=5  and `length_of_service`<=10 then 1 end)/count(*))*100,2) as percentage
from employee
group by `department`;

### 11) Find the top 3 regions with the highest number of employees who have met more than 80% of their KPIs and received at least one award, grouped by department and region.

In [ ]:
select `department`,`region`,
count(*)
from employee
where `awards_won`=1 and `KPIs_met_more_than_80`=1 
group by `department`,`region`
order by count(*) desc
limit 3;

### 12) Calculate the average length of service for employees per education level and gender, considering only those employees who have completed more than 2 trainings and have an average training score greater than 75 ( Round average length up to two decimal places if needed)

In [ ]:
select `education`,`gender`,
round(avg(`length_of_service`),2)
from employee
where `no_of_trainings`>2 and `avg_training_score`>75
group by `education`,`gender`;

### 13) For each department and recruitment channel, find the total number of employees who have met more than 80% of their KPIs, have a previous_year_rating of 5, and have a length of service greater than 10 years.

In [ ]:
select `department`,`recruitment_channel`,count(*)
from employee
where `KPIs_met_more_than_80`=1 and `previous_year_rating`=5 and `length_of_service`>10
group by `department`,`recruitment_channel`

### 14) Calculate the percentage of employees in each department who have received awards, have a previous_year_rating of 4 or 5, and an average training score above 70, grouped by department and gender ( Round percentage up to two decimal places if needed).

In [ ]:
select `department`,`gender`,
round((count(case when `awards_won`=1 and `previous_year_rating` in (4,5) and `avg_training_score`>70 then 1 end )/count(*))*100,2) as percentage
from employee
group by `department`,`gender`;

### 15) List the top 5 recruitment channels with the highest average length of service for employees who have met more than 80% of their KPIs, have a previous_year_rating of 5, and an age between 25 and 45 years, grouped by department and recruitment channel. ( Round average length up to two decimal places if needed).

In [ ]:
select `department`,`recruitment_channel`,round(avg(`length_of_service`),2)
from employee
where `KPIs_met_more_than_80`=1 and `previous_year_rating`=5 and age between 25 and 45
group by `department`,`recruitment_channel`
order by avg(`length_of_service`) desc
limit 5;